workspace/InformationRegisters/АукШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукШаблоныСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗаголовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресатСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукАдресатыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукАдресатыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукАдресатыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникАукциона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/InformationRegisters/АукШаблоныСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ШаблонСообщенияУчастникуПоОтбору(пСткОтбор) Экспорт
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("ВидСообщения",		Новый ОписаниеТипов("ПеречислениеСсылка.АукВидыСообщений"));
	тз.Колонки.Добавить("ВидАукциона",		Новый ОписаниеТипов("СправочникСсылка.АукВидыАукционов"));
	тз.Колонки.Добавить("Участник",			Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	
	Для Каждого ЭлУчастник Из пСткОтбор.Участники Цикл	
		НовСтрока = тз.Добавить();
		
		НовСтрока.ВидСообщения		= пСткОтбор.ВидСообщения;
		НовСтрока.ВидАукциона		= пСткОтбор.ВидАукциона;
		НовСтрока.Участник			= ЭлУчастник;	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзТемп.ВидСообщения КАК ВидСообщения,
	|	тзТемп.ВидАукциона КАК ВидАукциона,
	|	тзТемп.Участник КАК Участник
	|ПОМЕСТИТЬ втТемп
	|ИЗ
	|	&тзТемп КАК тзТемп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукШаблоныСообщений.ТекстШаблона КАК ТекстШаблона,
	|	АукШаблоныСообщений.ТекстЗаголовка КАК ТекстЗаголовка,
	|	0 КАК Приоритет,
	|	втТемп.Участник КАК Участник
	|ПОМЕСТИТЬ втШаблонСПриоритетом
	|ИЗ
	|	втТемп КАК втТемп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|		ПО втТемп.ВидСообщения = АукШаблоныСообщений.ВидСообщения
	|			И (АукШаблоныСообщений.ВидАукциона = ЗНАЧЕНИЕ(Справочник.АукВидыАукционов.ПустаяСсылка))
	|			И (АукШаблоныСообщений.АдресатСообщения = ЗНАЧЕНИЕ(Перечисление.АукАдресатыСообщений.УчастникАукциона))
	|			И (АукШаблоныСообщений.Участник = ЗНАЧЕНИЕ(Справочник.АукУчастникиАукционов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АукШаблоныСообщений.ТекстШаблона,
	|	АукШаблоныСообщений.ТекстЗаголовка,
	|	1,
	|	втТемп.Участник
	|ИЗ
	|	втТемп КАК втТемп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|		ПО втТемп.ВидСообщения = АукШаблоныСообщений.ВидСообщения
	|			И (АукШаблоныСообщений.ВидАукциона <> ЗНАЧЕНИЕ(Справочник.АукВидыАукционов.ПустаяСсылка))
	|			И втТемп.ВидАукциона = АукШаблоныСообщений.ВидАукциона
	|			И (АукШаблоныСообщений.АдресатСообщения = ЗНАЧЕНИЕ(Перечисление.АукАдресатыСообщений.УчастникАукциона))
	|			И (АукШаблоныСообщений.Участник = ЗНАЧЕНИЕ(Справочник.АукУчастникиАукционов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АукШаблоныСообщений.ТекстШаблона,
	|	АукШаблоныСообщений.ТекстЗаголовка,
	|	2,
	|	втТемп.Участник
	|ИЗ
	|	втТемп КАК втТемп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|		ПО втТемп.ВидСообщения = АукШаблоныСообщений.ВидСообщения
	|			И (АукШаблоныСообщений.АдресатСообщения = ЗНАЧЕНИЕ(Перечисление.АукАдресатыСообщений.УчастникАукциона))
	|			И (АукШаблоныСообщений.Участник <> ЗНАЧЕНИЕ(Справочник.АукУчастникиАукционов.ПустаяСсылка))
	|			И втТемп.Участник = АукШаблоныСообщений.Участник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШаблонСПриоритетом.ТекстШаблона КАК Шаблон,
	|	втШаблонСПриоритетом.ТекстЗаголовка КАК Заголовок,
	|	втШаблонСПриоритетом.Участник КАК Участник
	|ИЗ
	|	втШаблонСПриоритетом КАК втШаблонСПриоритетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(втШаблонСПриоритетом.Приоритет) КАК Приоритет,
	|			втШаблонСПриоритетом.Участник КАК Участник
	|		ИЗ
	|			втШаблонСПриоритетом КАК втШаблонСПриоритетом
	|		
	|		СГРУППИРОВАТЬ ПО
	|			втШаблонСПриоритетом.Участник) КАК ВложенныйЗапрос
	|		ПО втШаблонСПриоритетом.Приоритет = ВложенныйЗапрос.Приоритет
	|			И втШаблонСПриоритетом.Участник = ВложенныйЗапрос.Участник";
	
	Запрос.УстановитьПараметр("тзТемп",	тз);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат Неопределено;	
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		
		сооРезультат = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			сооРезультат.Вставить(Выборка.Участник, Новый Структура("Шаблон, Заголовок", Выборка.Шаблон, Выборка.Заголовок));	
		КонецЦикла;	
		
		Возврат сооРезультат;
	КонецЕсли;	
	
КонецФункции	

Функция ШаблонСообщенияАвторуПоОтбору(пСткОтбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукШаблоныСообщений.ТекстШаблона КАК ТекстШаблона,
	|	АукШаблоныСообщений.ТекстЗаголовка КАК ТекстЗаголовка,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ втШаблонСПриоритетом
	|ИЗ
	|	РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|ГДЕ
	|	АукШаблоныСообщений.ВидСообщения = &ВидСообщения
	|	И АукШаблоныСообщений.ВидАукциона = ЗНАЧЕНИЕ(Справочник.АукВидыАукционов.ПустаяСсылка)
	|	И АукШаблоныСообщений.АдресатСообщения = ЗНАЧЕНИЕ(Перечисление.АукАдресатыСообщений.Автор)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АукШаблоныСообщений.ТекстШаблона,
	|	АукШаблоныСообщений.ТекстЗаголовка,
	|	1
	|ИЗ
	|	РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|ГДЕ
	|	АукШаблоныСообщений.ВидСообщения = &ВидСообщения
	|	И АукШаблоныСообщений.ВидАукциона = &ВидАукциона
	|	И АукШаблоныСообщений.АдресатСообщения = ЗНАЧЕНИЕ(Перечисление.АукАдресатыСообщений.Автор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШаблонСПриоритетом.ТекстШаблона КАК Шаблон,
	|	втШаблонСПриоритетом.ТекстЗаголовка КАК Заголовок
	|ИЗ
	|	втШаблонСПриоритетом КАК втШаблонСПриоритетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(втШаблонСПриоритетом.Приоритет) КАК Приоритет
	|		ИЗ
	|			втШаблонСПриоритетом КАК втШаблонСПриоритетом) КАК ВложенныйЗапрос
	|		ПО втШаблонСПриоритетом.Приоритет = ВложенныйЗапрос.Приоритет";
	
	Запрос.УстановитьПараметр("ВидСообщения",	пСткОтбор.ВидСообщения);
	Запрос.УстановитьПараметр("ВидАукциона",	пСткОтбор.ВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат Неопределено;	
	Иначе		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	КонецЕсли;	
	
КонецФункции

Функция ОтсутствующиеДанныеОповещенийПоВидамСообщений(пМасВидыСообщений = Неопределено) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыСообщений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЗначимыеВидыСообщений
	|ИЗ
	|	Перечисление.АукВидыСообщений КАК АукВидыСообщений
	|ГДЕ
	|	&ОтборПоВидам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗначимыеВидыСообщений.Ссылка КАК ВидСообщения
	|ИЗ
	|	втЗначимыеВидыСообщений КАК втЗначимыеВидыСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|		ПО втЗначимыеВидыСообщений.Ссылка = АукШаблоныСообщений.ВидСообщения
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗначимыеВидыСообщений.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(АукШаблоныСообщений.ВидСообщения) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЗначимыеВидыСообщений.Ссылка КАК ВидСообщения
	|ИЗ
	|	втЗначимыеВидыСообщений КАК втЗначимыеВидыСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукШаблоныСообщений КАК АукШаблоныСообщений
	|		ПО втЗначимыеВидыСообщений.Ссылка = АукШаблоныСообщений.ВидСообщения
	|ГДЕ
	|	ЕСТЬNULL(АукШаблоныСообщений.ТекстЗаголовка, """") = """"";
	
	Если пМасВидыСообщений <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидам", "АукВидыСообщений.Ссылка В(&ВидыСообщений)");
		
		Запрос.УстановитьПараметр("ВидыСообщений", пМасВидыСообщений);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидам", "ИСТИНА");	
	КонецЕсли;	
	
	масРезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	сткРезультат = Новый Структура;
	сткРезультат.Вставить("ОтсутствующиеШаблоны",	масРезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("ВидСообщения")); 
	сткРезультат.Вставить("ОтсутствующиеЗаголовки", масРезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("ВидСообщения"));
	
	Возврат сткРезультат;
КонецФункции	

Функция ОписаниеПараметровШаблонов() Экспорт
	Макет = ПолучитьМакет("ПараметрыШаблонов");
	
	облСтроки = Макет.ПолучитьОбласть("Строки");
	
	сооРезультат = Новый Соответствие;
	Для Сч = 1 По облСтроки.ВысотаТаблицы Цикл
		сооРезультат.Вставить(облСтроки.Область(Сч,1).Текст, облСтроки.Область(Сч,2).Текст);		
	КонецЦикла;
	
	Возврат сооРезультат;
КонецФункции	

Функция ПараметрыШаблоновПоШаблону(пСтрШаблон) Экспорт
	сткРезультат = Новый Структура("Общие, Индивидуальные", Новый Массив, Новый Массив);
	
	// 1. Получить все параметры шаблонов
	масПараметрыШаблонов = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(
															пСтрШаблон, АукОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
																									
	// 2. Разделить все параметры на 2 категории
	Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
		Если ЭтоИндивидуальныйПараметрШаблона(ЭлМас) Тогда
			сткРезультат.Индивидуальные.Добавить(ЭлМас);	
		Иначе	
			сткРезультат.Общие.Добавить(ЭлМас);
		КонецЕсли;
	КонецЦикла;
	
	Возврат сткРезультат;
КонецФункции

Функция ЭтоИндивидуальныйПараметрШаблона(пИмяПараметра)
	Возврат пИмяПараметра = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ИМЯ"
			Или пИмяПараметра = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФАМИЛИЯ_ИО"
			Или пИмяПараметра = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФИО"
			Или пИмяПараметра = "УЧАСТНИК_НАИМЕНОВАНИЕ"
			Или пИмяПараметра = "АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_УЧАСТНИКА"
			Или пИмяПараметра = "СТАВКА_ДАННЫЕ_СТАВКИ"
			Или пИмяПараметра = "СТАВКА_ДАННЫЕ_ПОБЕДНОЙ_СТАВКИ"
			Или пИмяПараметра = "ОТКАЗ_ВРЕМЯ_ПРИНЯТИЯ"
			Или пИмяПараметра = "СТАВКА_ВРЕМЯ_ПРИНЯТИЯ";
КонецФункции	

#КонецОбласти
